"boardMembers":[
  {"fullName": "Jen Maseda", "company": "MetroWest Conference For Women", "companyRole": "President", "email": "jenmaseda@metrowestconferenceforwomen.org", "personalStatement": "The success of all women, depends on the strength of our network and our level of commitment to personal growth, while supporting the advancement of others. This Conference is the means by which this can happen in our region. Providing this platform for women to achieve their extraordinary lives is my passion and I am grateful to serve."}
  {"fullName": "Stephanie Kenney", "company": "Bose", "companyRole": "Community Relations Manager", "email": "kenney.stephanie@gmail.com", "personalStatement": "It is important to me to see women collaborating, sharing ideas, and encouraging each other to be extraordinary. By working together with women and men in the MetroWest region, we are able to harness the energy of this active community and work together to ensure the next generation of women and girls have every opportunity afforded to them!"}
  {"fullName": "Beth Reynolds", "company": "Town of Ashland", "companyRole": "Economic Development Director", "email": "breynolds@ashlandmass.com", "personalStatement": "The MetroWest Conference for Women will provide resources, encouragement, a sense of community and lasting connections for anyone that desires to be a part of something larger. This conference will inspire and unite our region moving us forward together."}
  {"fullName": "Susan Scully Petroni", "company": "Petroni Media Company", "companyRole": "Owner", "email": "petronimedia@gmail.com", "personalStatement": "I'm excited about the MetroWest Conference for Women as it will bring resources directly to MetroWest to empower women to live authentic lives, to inspire women to reach their goals, and to support women seeking leadership roles."}
  {"fullName": "Dawn Ross", "company": "Framingham State University", "companyRole": "Director Career Services and Employer Relations", "email": " ", "personalStatement": "Bringing a diverse world-class conference to the MetroWest area is imperative for enhancing the professional, educational, leadership and personal development and lives of attendees inside and outside our community. My hope for the attendees is that they will participate in a wide array of presentations/workshops and create networking and mentoring opportunities for impactful and enduring personal growth."}
  {"fullName": "Bonnie Biocchi", "company": "Habitat for Humanity Metrowest/Greater Worcester", "companyRole": "Director of Development", "email": "bonnie.biocchi@habitatmwgw.org", "personalStatement": "The Women of MetroWest deserve a world-class conference to help them move forward with their creative ideas, employment goals and personal aspirations. I believe this conference will help women achieve their dreams, establish a lasting network of female colleagues and develop long-term relationships that will yield many positive results."}
  {"fullName": "Wendy Esche", "company": " ", "companyRole": " ", "email": " ", "personalStatement": " "}
  {"fullName": "Debra Sayre", "company": "Kids Connect, Inc.", "companyRole": "Director", "email": "debrasayre@gmail.com", "personalStatement": "The talents and gifts of women add to the value and quality of any community they are engaged in. I believe this conference will support the addition or expansion of these qualities to more communities."}
  {"fullName": "Mal Duane", "company": "Live Smart-Love Smart & Metrowest Homes", "companyRole": "CEO", "email": "malduane@gmail.com", "personalStatement": "The most powerful energy on the planet is when women collaborate. I am passionate about helping women grow personally and professionally"}
  {"fullName": "Wade Blackman", "company": "Congresswoman Katherine Clark", "companyRole": "District Counsel", "email": "awadeblackman@gmail.com", "personalStatement": " "}
  {"fullName": "Janet Leobruno", "company": " ", "companyRole": "Framingham Housing Authority Commissioner, Framingham Charter Commissioner, Resiliency For Life Board of Directors", "email": "janetleombruno@aol.com", "personalStatement": " "}
  {"fullName": "Francesca Cerutti-Harris", "company": "Access Framingham TV", "companyRole": "Assistant Director", "email": "fch@accessfram.tv", "personalStatement": "I'm excited about an event focused on issues and interests that is engaging and most importantly, uniting for the women of MetroWest."}
  {
