[
    {
        "name": "Nicole Sahin",
        "title": "Chief Executive Officer, Globalization Partners",
        "description": "Boston-based Globalization Partners is currently ranked as the #1 Fastest Growing Women-Led Company in America by Inc. Magazine, and recently won Ivy Exec’s award as the Top Women-led Business in America to work for in 2017 based on surveys to its team. Nicole's talk is \"Building a Unicorn: Fireside Chat with CEO of the #1 Female Fastest-Growing Private Company in America\". Globalization Partners has some well-known names on it’s executive team, including Nicole Sahin (CEO), Debbie Millin (COO), and Nancy Cremins (GC). How is it possible to build a scalable, fast-growth company spanning 150+countries while also building an award-winning culture? Join us to find out.",
        "website": "http://www.inc.com/alix-stuart/2016-inc5000-global-consulting-firm-run-by-women.html"
    },
    {
        "name": "Dr. Patti Fletcher",
        "title": "CEO, PSD Network LLC",
        "description": "Dr. Fletcher is a voice of change inside global tech firm SAP, speaking and writing about gender in leadership and technology. Dr. Fletcher sits on the board of Astia, an international non-profit supporting women-led, high-growth startups, and is part of Astia Angels’ investing arm. She is professionally affiliated with the Babson College-based business accelerator Women Innovating Now (WIN Lab) as well as The Boston Club, focused on increasing women-held board seats on companies in Massachusetts. She is the founder of PSDNetwork LLC, a consultancy advising women executives (poised to become CEOs or board members) as well as corporations seeking to address women's access and equity. Patti's book, hitting the shelves in January 2018, Disrupters - Success Strategies of Women Who Break the Mold has been called the “anti-Lean In”. Come hear a preview!",
        "website": "www.drpattifletcher.com"
    },
    {
        "name": "Maria Marlowe",
        "title": "Speaker, Author, & Real Food Evangelist",
        "description": "Maria is changing the way America eats.  As an Integrative Nutrition Health Coach & Speaker she inspires audiences to prioritize their health and get excited to improve their eating habits.  She makes healthy living simple, through practical, actionable advice (delivered with a dose of humor).  Maria is the author of The Real Food Grocery Guide and specializes in improving health, weight, and skin through eating real food and living a healthy lifestyle. Maria Marlowe will present \"Excuses Be Gone! How to Create Healthy Habits That Stick\".",
        "website": "www.mariamarlowe.com"
    },
    {
        "name": "Liz O'Donnell",
        "title": "Speaker, Author, And Entrepreneur",
        "description": " Liz O’Donnell, a longtime marketing executive, is the author of Mogul, Mom & Maid: The Balancing Act of the Modern Woman, which examines the impact of women’s personal lives on their careers and ways that business can support working women.  An award-winning blogger, she runs the website Working Daughter and is at work on her second book, a guide to caring for aging parents without losing your job, your marriage or your sanity.  Liz is the co-founder of SheStarts, which supports the growing pipeline of women entrepreneurs in Boston through networking, coaching and events. Liz is a frequent speaker and consultant to women seeking to thrive and the organizations wanting to mobilize them. ",
        "website": "www.workingdaughter.com "
    },
  {
    "name": "Stephanie Leydon",
    "title": "Feature Reporter",
    "description": "Stephanie Leydon is a feature reporter contributing to all WGBH News platforms including the nightly news and public affairs television program Greater Boston, 89.7 FM Boston’s Local NPR and WGBHNews.org. Before coming to WGBH, Stephanie spent 16 years as a news reporter and anchor at television stations in Georgia, New Hampshire and Boston. Her work has been recognized with a regional Emmy award for spot news coverage; a Massachusetts Broadcasters award for a program on early childhood education; and multiple Emmy award nominations for hosting, feature reporting and a series on early onset Alzheimer’s.",
    "website": "www.WGBH.com"
  },
    {
        "name": "Kelly Macfarland",
        "title": "Irresistible Comedian",
        "description": "As an experienced stand up comedian, Kelly has an extensive and well-rounded resume including comedy clubs, theaters, colleges and several television appearances. Kelly is currently touring clubs and colleges across the country and has entertained our US troops overseas.  Kelly headlined the 2009 Boston Women in Comedy Festival, was first runner up in the 2009 Boston Comedy Festival, voted Best of the Fest 2010 Aspen Rooftop Comedy Festival, appeared in the Oddball Festival 2015 and performed on the Verizon Comedy Stage at Boston Calling 2016 and 2017 (coming soon). Kelly has also appeared on Stand Up in Stilettos on the TV Guide Channel, Comedy Central’s Premium Blend and is the host of the web series, Fit or Fad for Scripps Network. Most recently, Kelly was part of the Top 100 Comedians of Last Comic Standing Season 9, appeared on AXS Gotham Comedy LIVE and won the professional category of the Ladies of Laughter 2016 competition.",
        "website": "http://kellymacfarland.com/"
    },
    {
        "name": "Rachael Rubin"
    },
    {
        "name": "Linda Townsend"
    },
    {
        "name": "Lisa Vasile",
        "title": "NP, 4 Better Health Medicine",
        "description": "Lisa@4betterhealthmedicine.com",
        "website": "www.4betterhealthmedicine.com"
    },
    {
        "name": "Jenna Stockwell",
        "title": "Sustainable Lifestyle Consultant, Viridian International",
        "description": "jenna.marzullo@gmail.com",
        "website": "jenna.travellight.com"
    },
    {
        "name": "Bobbie Carlton"
    },
    {
        "name": "Carol Fishman Cohen"
    },
    {
        "name": "Ilyssa Greene Frey",
        "title": "Director of Alumnae Communications and Marketing, Wellesley College Alumnae Association",
        "description": "ilyssafrey@gmail.com"
    },
    {
        "name": "Cheryl Kiser"
    },
    {
        "name": "Sylvia Diaz-Ruiz",
        "title": "Co-Owner, Ruiz Transportation Services, LLC",
        "website": "transport@rideruiz.com"
    },
    {
        "name": "Enna Jimenez"
    },
    {
        "name": "Brenda Cole"
    },
    {
        "name": "Roxann Cooke"
    },
    {
        "name": "Dana Neshe"
    },
    {
        "name": "Nancy Cantor",
        "title": "CEO, Cantor Consulting",
        "description": "nancy@cantorconsulting.com",
        "website": "www.Dreamfactorycommunity.com  www.theentrepreneursconnection.com"
    },
    {
        "name": "Bonnie Biocchi",
        "title": "Director of Development, Habitat for Humanity Metrowest/Greater Worcester",
        "description": "bonnie.biocchi@habitatmwgw.org"
    },
    {
        "name": "Cheryl Cronin"
    },
    {
        "name": "Helen Lemoine"
    },
    {
        "name": "Janell Burley Hofmann"
    },
    {
        "name": "Vanessa Gobes"
    },
    {
        "name": "Belinda Rosenblum"
    },
    {
        "name": "Marie Paturzo",
        "title": "Financial Advisor, Merrill Lynch"
    },
    {
        "name": "Clemia Brittenum"
    },
    {
        "name": "Katelin Cwieka",
        "title": "AVP Social Media & Brand Communications, Avidia Bank"
    },
    {
        "name": "Kristina Tsipouras"
    },
    {
        "name": "Suzan Czajkowski",
        "title": "Marketing Consultant & Communication Coach, TheCommCoach",
        "description": "SuzanCz@gmail.com"
    },
    {
        "name": "Rachel Dunham",
        "title": "Founder, Brand Therapy™, Brand Therapy™",
        "description": "rachel@yourbrandtherapy.com",
        "website": "www.yourbrandtherapy.com"
    },
    {
        "name": "Catherine Hummel"
    },
    {
        "name": "Samantha Burns",
        "title": "Licensed Couples Counselor & Dating Coach, LoveSuccessfully.com",
        "description": "samantha@lovesuccessfully.com",
        "website": "lovesuccessfully.com"
    },
    {
        "name": "Susan Trotter, Ph.D.",
        "title": "Professional Life Coach, Susan Trotter, Ph.D. - Life Coaching",
        "description": "Susantrotterphd@gmail.com",
        "website": "Facebook.com/susantrotterphd/"
    },
    {
        "name": "Carly Baker"
    },
    {
        "name": "Erin Mahoney"
    },
    {
        "name": "Michelle Cove"
    },
    {
        "name": "Siiri Morley"
    },
    {
        "name": "Maria Marlowe",
        "title": "Integrative Nutrition Health Coach & Author, Maria Marlowe Integrative Nutrition ",
        "description": "maria@mariamarlowe.com",
        "website": "www.mariamarlowe.com"
    },
    {
        "name": "Liz O'Donnell",
        "title": "Founder Working Daughter and Rent-A-Sister, Working Daughter",
        "description": "lizodool@gmail.com",
        "website": "www.workingdaughter.com"
    }
]